### 2. Display inode information using ls -i and interpret the results.

Command use: `ls -i`

### 3. Create and delete files and directories, and observe changes in inode numbers.

1. Create new folder and new file.<br>
    Command use: `mkdir testfolder` and ` touch testfile.txt`<br>
    Output: <b>46412 testfile.txt  46411 testfolder</b><br>
2. Now Delete those.<br>
    Command use: `rmdir testfolder` and `rm testfile.txt`<br>
3. Create new folder and new file with the same name again.<br>
    Command use: `mkdir testfolder` and ` touch testfile.txt`<br>
    Output: <b>46412 testfile.txt  46411 testfolder</b><br>

### 5. Write a program in python to find alphabet/s having maximum number of instances in a given file.

In [13]:
try:
    f1 = open('file1.txt', 'r+')
    content = f1.read().lower()
    
    freq = {}
    for word in content:
        for char in word:
            if char != " ":
                if char not in freq:
                    freq[char] = 1
                else:
                    freq[char] += 1
    max_count = max(freq.values())
    max_alphabets = [char for char, count in freq.items() if count == max_count]

    print(max_alphabets, max_count)
    
except Exception as e:
    print('An Error has Occured:', e)
finally:
    f1.close()

['w', 'e'] 5

### 6. A file contains information about programs and courses in the following format: Program,course. Write a Python program to find the number of courses against each program.
Eg:<br>
Program,Course<br>
MCA,Database<br>
MCA,Java<br>
M.Sc,Data Structure<br>
B.Sc, Python<br>
------- The output should be: MCA-2, M.Sc-01, B.Sc-01

In [14]:
program_course_count = {}

with open('courses.txt', 'r') as file:
    lines = file.readlines()

for line in lines[1:]:
    program, course = line.strip().split(',')
    if program in program_course_count:
        program_course_count[program] += 1
    else:
        program_course_count[program] = 1
        
for program, count in program_course_count.items():
    print(f"{program}-{count:02}")

MCA-02
M.Sc-01
B.Sc-01

### 7. A file contains information about employees with the following parameters: Name,Id, Salary, Dname. Write a Python program to write one more column HRA (Houserent allowances) to this file, where HRA= 18%of salary
Eg: Suppose the existing file is as follows, where you need to add HRA column:<br>
Name,id,salary, Dname<br>
Amar,101,20000,Sales<br>
Ammar,102,22000,Marketing<br>
Rahil,103,18000,Sales<br>

In [15]:
import pandas as pd

In [16]:
df = pd.read_csv('employee_data.csv')
df.head()

    Name   id  salary      Dname
0   Amar  101   20000      Sales
1  Ammar  102   22000  Marketing
2  Rahil  103   18000      Sales

In [17]:
df['HRA'] = df['salary'] * 0.18

In [18]:
df.head()

    Name   id  salary      Dname     HRA
0   Amar  101   20000      Sales  3600.0
1  Ammar  102   22000  Marketing  3960.0
2  Rahil  103   18000      Sales  3240.0